[
    {
      "title": "102 Dalmatians",
      "year": 2000,
      "cast": [
        "Glenn Close",
        "Gérard Depardieu",
        "Alice Evans"
      ],
      "genres": [
        "Comedy",
        "Family",
        "Crime"
      ],
      "href": "102_Dalmatians",
      "extract": "102 Dalmatians is a 2000 American crime comedy film directed by Kevin Lima and produced by Edward S. Feldman and Walt Disney Pictures. The sequel to the 1996 film 101 Dalmatians, a live-action remake of the 1961 Disney animated film of the same name, it stars Glenn Close reprising her role as Cruella de Vil as she attempts to steal puppies for her \"grandest\" fur coat yet. Glenn Close and Tim McInnerny were the only two actors from the 1996 film to return for the sequel. The film received generally negative reviews from critics and was unable to achieve the box office success of its predecessor, although the film was nominated for the Academy Award for Best Costume Design.",
      "thumbnail": "https://upload.wikimedia.org/wikipedia/en/f/fe/102_dalmatians_poster.jpg",
      "thumbnail_width": 220,
      "thumbnail_height": 327
    },
    {
      "title": "28 Days",
      "year": 2000,
      "cast": [
        "Sandra Bullock",
        "Viggo Mortensen"
      ],
      "genres": [
        "Drama",
        "Comedy"
      ],
      "href": "28_Days_(film)",
      "extract": "28 Days is a 2000 American comedy-drama film directed by Betty Thomas and written by Susannah Grant. Sandra Bullock stars as Gwen Cummings, a newspaper columnist obliged to enter rehabilitation for alcoholism. The film costars Viggo Mortensen, Dominic West, Elizabeth Perkins, Azura Skye, Steve Buscemi, and Diane Ladd.",
      "thumbnail": "https://upload.wikimedia.org/wikipedia/en/f/f7/28_Days_Poster.jpg",
      "thumbnail_width": 238,
      "thumbnail_height": 360
    },
    {
      "title": "3 Strikes",
      "year": 2000,
      "cast": [
        "Brian Hooks",
        "N'Bushe Wright"
      ],
      "genres": [
        "Comedy"
      ],
      "href": "3_Strikes_(film)",
      "extract": "3 Strikes is a 2000 American comedy film written and directed by DJ Pooh, and starring Brian Hooks, N'Bushe Wright, Faizon Love and David Alan Grier. Despite some commercial success, it was negatively received by critics. The title refers to California's habitual offender law, whereby three convictions confer an automatic life sentence.",
      "thumbnail": "https://upload.wikimedia.org/wikipedia/en/d/db/3_Strikes_Poster.jpg",
      "thumbnail_width": 225,
      "thumbnail_height": 333
    },
    {
      "title": "The 6th Day",
      "year": 2000,
      "cast": [
        "Arnold Schwarzenegger",
        "Robert Duvall",
        "Michael Rooker",
        "Tony Goldwyn",
        "Michael Rapaport",
        "Sarah Wynter",
        "Rodney Rowland",
        "Wendy Crewson",
        "Terry Crews"
      ],
      "genres": [
        "Science Fiction",
        "Action"
      ],
      "href": "The_6th_Day",
      "extract": "The 6th Day is a 2000 American science fiction action film directed by Roger Spottiswoode and starring Arnold Schwarzenegger, Tony Goldwyn, Michael Rapaport, and Robert Duvall. In the film, a family man of the future is illegally cloned by accident as part of a vast conspiracy involving a shady billionaire businessman, and is thrust into a struggle to clear his name and protect his family from the conspirators who seek to keep the cloning a secret. The title refers to the Judeo-Christian Genesis creation narrative, where God created mankind on the sixth day. The film was Terry Crews' acting debut.",
      "thumbnail": "https://upload.wikimedia.org/wikipedia/en/a/a0/The_6th_Day_%282000_film%29.jpg",
      "thumbnail_width": 257,
      "thumbnail_height": 387
    },
    {
      "title": "Across the Line",
      "year": 2000,
      "cast": [
        "Brad Johnson",
        "Adrienne Barbeau",
        "Brian Bloom"
      ],
      "genres": [
        "Thriller",
        "Western"
      ],
      "href": "Across_the_Line_(2000_film)",
      "extract": "Across the Line is a 2000 American Neo-Western film directed by Martin Spottl and starring Brad Johnson and Sigal Erez. Johnson plays a small-town Texas sheriff who falls for an illegal immigrant (Erez) who witnessed a murder on the Mexican border. While not an overtly political film, Across the Line portrays illegal immigrants in a generally positive light and dramatizes their motivations and problems from a sympathetic point of view. In La Opinion Jean Rodriguez Flores wrote, \"The film Across the Line isn't just about the difficulties of crossing illegally into the United States, but it also reflects the tragedy of hundreds of people who are forced to leave their families for the \"promised land.\" Some critics praised the film for its emotional intensity, authenticity, and integrity, but others questioned it for turning the plight of illegal immigrants into mainstream entertainment. Independently financed and produced, Across the Line was distributed by Lionsgate Entertainment.",
      "thumbnail": "https://upload.wikimedia.org/wikipedia/en/4/49/Across_the_Line.jpg",
      "thumbnail_width": 246,
      "thumbnail_height": 345
    } 
]